In [9]:
import pandas as pd
import numpy as np
etiquetas = ['A','B', 'C']
my_data =[10,20,30]
arr = np.array(my_data)
d= {'a':10,'b':20,'c':30} #11 diccionario
pd.Series(data =my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [10]:
pd.Series(data = my_data, index =etiquetas)

A    10
B    20
C    30
dtype: int64

In [11]:
pd.Series(data=[sum, len, str]) #Puede llamara objetos

0    <built-in function sum>
1    <built-in function len>
2               <type 'str'>
dtype: object

In [29]:
ser1 = pd.Series([1,2,3,4],['USA', 'MEX', 'ALEMANIA', 'JAPON'])
ser2 = pd.Series([1,2,3,4],['USA', 'MEX', 'ITALIA', 'JAPON'])

In [13]:
ser1

USA         1
MEX         2
ALEMANIA    3
JAPON       4
dtype: int64

In [17]:
ser2[0]

1

ser[0,0]

In [22]:
ser3=pd.Series(data=etiquetas)

In [30]:
ser2

USA       1
MEX       2
ITALIA    3
JAPON     4
dtype: int64

In [31]:
ser2['ITALIA']

3

ser2

In [33]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)
df= pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [35]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [36]:
df['W']['A']

2.7068498393999381

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
type(df['W'])

pandas.core.series.Series

In [39]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [40]:
df['new']= df['W']+df['X']

In [42]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [43]:
df.drop('new',axis=1) #Borra new

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [46]:
df.drop('new',axis=1, inplace=True) #Borra new y con commit

In [47]:
df.drop('A') #Borra el renglon

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
    df.shape

(5, 4)

In [49]:
type(df.shape)

tuple

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df.loc['A'] #Muestra el renglon

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [52]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [54]:
df.loc['B','Y'] #Muestra interseccion

-0.84807698340363147

In [58]:
df.loc[['A','B'],['W','Y']] #Muestra interseccion

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [67]:
df.loc[['A','B'],['W','Y']].mean() #Muestra interseccion con promedio

W    1.678984
Y    0.029946
dtype: float64

In [66]:
df.loc[['A','B'],['W','Y']].sum() #Muestra interseccion con promedio

W    3.357968
Y    0.059892
dtype: float64

In [65]:
df.loc[['A','B'],['W','Y']].count() #Muestra interseccion suma

W    2
Y    2
dtype: int64

In [68]:
df.loc[['A','B'],['W','Y']].pow(5) #Muestra interseccion potencia

            W         Y
A  145.318472  0.617101
B    0.117030 -0.438709

In [71]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [76]:
resultado = df>0
df[resultado]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df['W']>0 #Mayor a 0 en olumna 1

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [78]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df[df['Z']>0].sum() #suma

W    3.737457
X    1.528700
Y    1.732623
Z    2.748356
dtype: float64

In [81]:
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [86]:
df[df['W']>0][['X','Y']].sum()

X    1.528700
Y    1.732623
dtype: float64

In [87]:
df['X'].sum()*df['Y'].sum() # Multiplica la sumatoria de X+ Y

5.130795770712328

In [90]:
df.sum()/df.count() # Calcula el promedio de dos columnas

W    0.343858
X    0.453764
Y    0.452287
Z    0.431871
dtype: float64

In [94]:
df[df['X']>df['W']] #Muestra los valores de x mas grandes que w

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df['W'].sum()*df['X'].sum()

3.9007610862349655

In [103]:
 df['W'].sum()*df['X'].sum()>df['Y'] #suma X + Y y valida si es mayor a Y

A    True
B    True
C    True
D    True
E    True
Name: Y, dtype: bool

In [104]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [105]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [114]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509